import { Menus, Option, Menu } from "./types";

export const questionAndAnswers = {
  organizationQuestions_1:
    "יש איתנו אנשים ונשים מכל קשת המפה הפוליטית, אנחנו מאמינים שחילוקי דעות הם בריאים במסגרת דמוקרטית, ושהמסגרת צריכה לאפשר ייצוג טוב יותר ושיתוף רב יותר של אוכלוסיות שונות בתהליכי קבלת ההחלטות. אנו מקדמים נושאים שאנו יכולים להסכים עליהם ועובדים עם כל הממשלות בעשור האחרון.",
  organizationQuestions_2:
    "בשלב הזה המממן העיקרי הוא מייסד תנועה ישראלית (ארגון הגג של ישראל 2050), התעשיין בועז אמיתי. ניתן לקבל מידע נוסף באתר תנועה ישראלית –www.israelimovement.co.il",
  organizationQuestions_3:
    "אנו פועלים במגוון תחומים ופתוחים ליוזמות שעולות מהשטח. המכנה המשותף הוא מיקוד בבעיות שורש (על פני סימפטומים). תחומים לדוגמא בהם אנו עוסקים בשנים האחרונות ומאמינים שקיים בהם צורך לשינוי מבני מעמיק – חינוך, תחבורה, חיזוק הדמוקרטיה המקומית, תקשורת, תעסוקה וכלכלה ופיננסים.",
  processQuestions_1:
    "המיונים לתוכנית כוללים שלושה שלבים. בשלב הראשון תתבקשו להגיש את טופס הגשת המועמדות. בשלב השני יתקיימו מרכזי הערכה בתל אביב ובירושלים. בשלב השלישי חלק מהמועמדים/ות יוזמנו לראיון אישי. מועד קבלת תשובות על כניסה לתוכנית- 30.09.24",
  processQuestions_2:
    "התוכנית כוללת שלושה חודשי הכשרה על בסיס מפגשים שבועיים (בדרך כלל בימי שלישי) בהם נחקור את עולמות התוכן של מדיניות ציבורית, ממשל, דמוקרטיה, פעילות ציבורית אזרחית ופרלמנטרית ונרכוש כלים מעשיים לקידום שינויים מבניים במדינת ישראל באמצעות פעולות שטח, קידום מדיניות ו'מודל השפעה חכמה' עליו ניתן לקרוא באתר שלנו. המטרה שלנו היא שכל משתתפת ומשתתף בתוכנית ילמדו על הכח שלהם כאזרחים להשפיע על קבלת ההחלטות במדינה, יתנסו בפעילות חברתית וירתמו לפעילות צוותי השפעה שמטרתם לקדם את השינוי הכי משמעותי לפי ראות עיניהם.",
  processQuestions_3:
    'רצוי ומומלץ! אנו יוצאים מתוך נקודת הנחה שלא כל אחד יכול להיות "אקטיביסט במשרה מלאה". ההכשרה ושיטת של צוותי ההשפעה מותאמת לא.נשים עסוקים.',
  processQuestions_4:
    "לכל הפחות לשלושת חודשי ההכשרה. ההכשרה מקנה את היסודות והכלים, לאחריה תקימו מיזמים חדשים או תצטרפו לקיימים, בליווי מקצועי של התנועה. ההתחייבות המינימלית להקמת צוות לאחר ההכשרה- ארבעה חודשים, בהתאמה לאורח חייכם.",
  processQuestions_5:
    "בתום שלב ההכשרה של התוכנית נאפשר למשתתפים והמשתתפות שיבחרו בכך להיכנס לרשת העמיתים של ישראל 2050. הרשת משמשת פלטפורמה להתפתחות המקצועית והאישית של חבריה, ליצירת חיבורים הנוגעים לפרויקטים של משתתפי התוכנית, כל זאת תוך שהיא שואפת לקחת חלק פעיל בעיצוב המציאות החברתית בישראל. פעילות הרשת כוללת כנסים, תכנים מקצועיים בתחומי המדיניות, הכלכלה, עולמות מקצועיים שונים, התקשורת ועשייה אזרחית במסגרת הקמפיינים של התנועה וצוותי הפעילות. כמו כן, ניתן יהיה להשתלב בפעילות תנועה ישראלית.",
  processQuestions_6:
    'לא, ההשתתפות בתכנית היא על בסיס וולנטרי מתוך רצון ללמוד ולהיות חלק משינוי המציאות החברתית-כלכלית בישראל.  התכנית כוללת דמי השתתפות בסך 500 ש"ח. חוסר יכולת לשלם עלות זו לא מהווה חסם להשתתפות בתוכנית.',
};

export const menus: Menus = {
  main: {
    header: "תודה על התעניינות בתנועת ישראל 2050!",
    body: "אנא בחר.י את האפשרות המתאימה לך על ידי שליחת מספר:",
    options: [
      { id: "organizationQuestions", title: "שאלות על הארגון" },
      { id: "processQuestions", title: "שאלות על תהליך הגיוס" },
      { id: "humanRepresentativeQuestions", title: "מעבר לנציג אנושי" },
    ],
  },
  organizationQuestions: {
    header: "שאלות על הארגון",
    body: "בחר.י שאלה על הארגון על ידי שליחת מספר:",
    options: [
      { id: "organizationQuestions_1", title: "אתם ימין או שמאל?" },
      { id: "organizationQuestions_2", title: "מי מממן אתכם?" },
      { id: "organizationQuestions_3", title: "באילו תחומים אתם פועלים?" },
    ],
  },
  processQuestions: {
    header: "שאלות על תהליך הגיוס",
    body: "בחר.י שאלה על תהליך הגיוס על ידי שליחת מספר:",
    options: [
      {
        id: "processQuestions_1",
        title: "איך עובדים המיונים ומתי מקבלים תשובות?",
      },
      { id: "processQuestions_2", title: "מה כוללת התוכנית?" },
      { id: "processQuestions_3", title: "האם אפשר ללמוד או לעבוד במקביל?" },
      { id: "processQuestions_4", title: "לכמה זמן התוכנית דורשת מחויבות?" },
      {
        id: "processQuestions_5",
        title: "מהן האפשרויות לקחת חלק בארגון לאחר סיום התוכנית?",
      },
      { id: "processQuestions_6", title: "האם התוכנית כוללת מלגה?" },
    ],
  },
  humanRepresentativeQuestions: {
    header: "מעבר לנציג אנושי",
    body: "נציג שלנו יצור איתך קשר בקרוב.",
    options: [],
  },
};

export function renderMenu(menu: Menu) {
  let text = `${menu.header}\n${menu.body}\n`;
  menu.options.forEach((opt: Option, idx: number) => {
    text += `\n${idx + 1} - ${opt.title}`;
  });
  return text;
}
