// Questions and answers for each section
const organizationQA = [
  {
    question: "אתם ימין או שמאל?",
    answer:
      "יש איתנו אנשים ונשים מכל קשת המפה הפוליטית, אנחנו מאמינים שחילוקי דעות הם בריאים במסגרת דמוקרטית, ושהמסגרת צריכה לאפשר ייצוג טוב יותר ושיתוף רב יותר של אוכלוסיות שונות בתהליכי קבלת ההחלטות. אנו מקדמים נושאים שאנו יכולים להסכים עליהם ועובדים עם כל הממשלות בעשור האחרון.",
  },
  {
    question: "מי מממן אתכם?",
    answer:
      "בשלב הזה המממן העיקרי הוא מייסד תנועה ישראלית (ארגון הגג של ישראל 2050), התעשיין בועז אמיתי. ניתן לקבל מידע נוסף באתר תנועה ישראלית –www.israelimovement.co.il",
  },
  {
    question: "באילו תחומים אתם פועלים?",
    answer:
      "אנו פועלים במגוון תחומים ופתוחים ליוזמות שעולות מהשטח. המכנה המשותף הוא מיקוד בבעיות שורש (על פני סימפטומים). תחומים לדוגמא בהם אנו עוסקים בשנים האחרונות ומאמינים שקיים בהם צורך לשינוי מבני מעמיק – חינוך, תחבורה, חיזוק הדמוקרטיה המקומית, תקשורת, תעסוקה וכלכלה ופיננסים.",
  },
];

const processQA = [
  {
    question: "איך עובדים המיונים ומתי מקבלים תשובות?",
    answer:
      "המיונים לתוכנית כוללים שלושה שלבים. בשלב הראשון תתבקשו להגיש את טופס הגשת המועמדות. בשלב השני יתקיימו מרכזי הערכה בתל אביב ובירושלים. בשלב השלישי חלק מהמועמדים/ות יוזמנו לראיון אישי. מועד קבלת תשובות על כניסה לתוכנית- 30.09.24",
  },
  {
    question: "מה כוללת התוכנית?",
    answer:
      "התוכנית כוללת שלושה חודשי הכשרה על בסיס מפגשים שבועיים (בדרך כלל בימי שלישי) בהם נחקור את עולמות התוכן של מדיניות ציבורית, ממשל, דמוקרטיה, פעילות ציבורית אזרחית ופרלמנטרית ונרכוש כלים מעשיים לקידום שינויים מבניים במדינת ישראל באמצעות פעולות שטח, קידום מדיניות ו'מודל השפעה חכמה' עליו ניתן לקרוא באתר שלנו. המטרה שלנו היא שכל משתתפת ומשתתף בתוכנית ילמדו על הכח שלהם כאזרחים להשפיע על קבלת ההחלטות במדינה, יתנסו בפעילות חברתית וירתמו לפעילות צוותי השפעה שמטרתם לקדם את השינוי הכי משמעותי לפי ראות עיניהם.",
  },
  {
    question: "האם אפשר ללמוד או לעבוד במקביל?",
    answer:
      'רצוי ומומלץ! אנו יוצאים מתוך נקודת הנחה שלא כל אחד יכול להיות "אקטיביסט במשרה מלאה". ההכשרה ושיטת של צוותי ההשפעה מותאמת לא.נשים עסוקים.',
  },
  {
    question: "לכמה זמן התוכנית דורשת מחויבות?",
    answer:
      "לכל הפחות לשלושת חודשי ההכשרה. ההכשרה מקנה את היסודות והכלים, לאחריה תקימו מיזמים חדשים או תצטרפו לקיימים, בליווי מקצועי של התנועה. ההתחייבות המינימלית להקמת צוות לאחר ההכשרה- ארבעה חודשים, בהתאמה לאורח חייכם.",
  },
  {
    question: "מהן האפשרויות לקחת חלק בארגון לאחר סיום התוכנית?",
    answer:
      "בתום שלב ההכשרה של התוכנית נאפשר למשתתפים והמשתתפות שיבחרו בכך להיכנס לרשת העמיתים של ישראל 2050. הרשת משמשת פלטפורמה להתפתחות המקצועית והאישית של חבריה, ליצירת חיבורים הנוגעים לפרויקטים של משתתפי התוכנית, כל זאת תוך שהיא שואפת לקחת חלק פעיל בעיצוב המציאות החברתית בישראל. פעילות הרשת כוללת כנסים, תכנים מקצועיים בתחומי המדיניות, הכלכלה, עולמות מקצועיים שונים, התקשורת ועשייה אזרחית במסגרת הקמפיינים של התנועה וצוותי הפעילות. כמו כן, ניתן יהיה להשתלב בפעילות תנועה ישראלית.",
  },
  {
    question: "האם התוכנית כוללת מלגה?",
    answer:
      'לא, ההשתתפות בתכנית היא על בסיס וולנטרי מתוך רצון ללמוד ולהיות חלק משינוי המציאות החברתית-כלכלית בישראל.  התכנית כוללת דמי השתתפות בסך 500 ש"ח. חוסר יכולת לשלם עלות זו לא מהווה חסם להשתתפות בתוכנית.',
  },
];

// Function to format Q&A into a single string
const formatQA = (qaArray: Array<{ question: string; answer: string }>) => {
  return qaArray
    .map((qa, index) => {
      return `*_שאלה ${index + 1}: ${qa.question}_*\n${qa.answer}`;
    })
    .join("\n\n");
};

// Export formatted texts
export const formattedTexts = {
  organizationInfo: formatQA(organizationQA),
  processInfo: formatQA(processQA),
};
